IDEA StatiCa Open Model
Hanging.EdgeOrientationType Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Edge orientation type
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public EdgeOrientationType EdgeOrientationType { get; set; }
Public Property EdgeOrientationType As EdgeOrientationType
	Get
	Set
public:
property EdgeOrientationType EdgeOrientationType {
	EdgeOrientationType get ();
	void set (EdgeOrientationType value);
}
Property Value
Type: EdgeOrientationType
See Also
Reference
Hanging Class
IdeaRS.OpenModel.Detail Namespace